####################################################################################################
#                            Energy functions
#
####################################################################################################

# ---------------------------------------------------------------------------------------------------
# Calculate energy contribution from a single term in the energy sum of the Higgs terms.
function fᵣ(ϕ::LatticeSite, nb::Neighbors, h_pos::Int64, c::SystConstants)
    energy = 0.0
    Aᵣ = two_pi*c.f*(h_pos-1)
#    Aᵣ₋₁ = two_pi*c.f*(h_pos-2)
#    Aᵣ₋₂₁ = two_pi*c.f*(h_pos-3)
    ϕᵣ₊₁ = nb.ϕᵣ₊₁
    ϕᵣ₋₁ = nb.ϕᵣ₋₁
    ϕᵣ₊₂ = nb.ϕᵣ₊₂
    ϕᵣ₋₂ = nb.ϕᵣ₋₂
    ϕᵣ₊₃ = nb.ϕᵣ₊₃
    ϕᵣ₋₃ = nb.ϕᵣ₋₃
    
    # Kinetic energy Fₖ
    Fₖ = -0.5*c.γ^2*(ϕᵣ₊₁.u⁺*ϕᵣ₋₁.u⁺*cos(ϕᵣ₊₁.θ⁺-ϕᵣ₋₁.θ⁺ - (ϕ.A[1]+ϕᵣ₋₁.A[1]))
        + ϕᵣ₊₂.u⁺*ϕᵣ₋₂.u⁺*cos(ϕᵣ₊₂.θ⁺-ϕᵣ₋₂.θ⁺ - (ϕ.A[2]+2*Aᵣ+ϕᵣ₋₂.A[2]))
        + ϕᵣ₊₁.u⁻*ϕᵣ₋₁.u⁻*cos(ϕᵣ₊₁.θ⁻-ϕᵣ₋₁.θ⁻ - (ϕ.A[1]+ϕᵣ₋₁.A[1]))
        + ϕᵣ₊₂.u⁻*ϕᵣ₋₂.u⁻*cos(ϕᵣ₊₂.θ⁻-ϕᵣ₋₂.θ⁻ - (ϕ.A[2]+2*Aᵣ+ϕᵣ₋₂.A[2])))
    # 3D z-term
    Fₖ += -c.κ₅*0.5*(ϕᵣ₊₃.u⁺*ϕᵣ₋₃.u⁺*cos(ϕᵣ₊₃.θ⁺-ϕᵣ₋₃.θ⁺ - (ϕ.A[3]+ϕᵣ₋₃.A[3]))
        + ϕᵣ₊₃.u⁺*ϕᵣ₋₃.u⁺*cos(ϕᵣ₊₃.θ⁺-ϕᵣ₋₃.θ⁺ - (ϕ.A[3]+ϕᵣ₋₃.A[3]))
        - ϕ.u⁺^2 - ϕ.u⁻^2)
#	@test ϕᵣ₊₂.u⁺ == ϕ.u⁺ == ϕᵣ₊₁.u⁺ == ϕᵣ₋₁.u⁺ == ϕᵣ₋₂.u⁺
#	@test ϕᵣ₊₂.u⁻ == ϕ.u⁻ == ϕᵣ₊₁.u⁻ == ϕᵣ₋₁.u⁻ == ϕᵣ₋₂.u⁻
#	@test Fₖ == -(ϕ.u⁺^2+ϕ.u⁻^2)
    # Potential energy Fᵥ
    Fᵥ = c.γ^4*((ϕ.u⁺*ϕ.u⁻)^2*(2+c.ν*cos(2*(ϕ.θ⁺-ϕ.θ⁻))) + 0.5*(ϕ.u⁺^4 + ϕ.u⁻^4))
#	@test Fᵥ == (ϕ.u⁺*ϕ.u⁻)^2*(2+c.ν) + 0.5*(ϕ.u⁺^4 + ϕ.u⁻^4)
    # Band-anisotropy terms
    Fₐₙ = (c.ν+1)/4*c.γ^2*(
          ϕᵣ₊₂.u⁺*ϕᵣ₋₂.u⁻*cos(ϕᵣ₊₂.θ⁺-ϕᵣ₋₂.θ⁻ - (ϕ.A[2] + 2*Aᵣ + ϕᵣ₋₂.A[2])) 
        - ϕᵣ₊₁.u⁺*ϕᵣ₋₁.u⁻*cos(ϕᵣ₊₁.θ⁺-ϕᵣ₋₁.θ⁻ - (ϕ.A[1] + ϕᵣ₋₁.A[1])) 
        + ϕᵣ₊₂.u⁻*ϕᵣ₋₂.u⁺*cos(ϕᵣ₊₂.θ⁻-ϕᵣ₋₂.θ⁺ - (ϕ.A[2] + 2*Aᵣ + ϕᵣ₋₂.A[2])) 
        - ϕᵣ₊₁.u⁻*ϕᵣ₋₁.u⁺*cos(ϕᵣ₊₁.θ⁻-ϕᵣ₋₁.θ⁺ - (ϕ.A[1] + ϕᵣ₋₁.A[1])))
#	@test Fₐₙ == 0
    # Mixed gradient terms
    Fₘ = c.γ^2*(c.ν-1)/4*(
          ϕᵣ₊₁.u⁺*ϕᵣ₊₂.u⁻*sin(ϕᵣ₊₂.θ⁻-ϕᵣ₊₁.θ⁺ - (ϕ.A[2]+Aᵣ-ϕ.A[1])) 
        + ϕᵣ₋₁.u⁺*ϕᵣ₋₂.u⁻*sin(ϕᵣ₋₂.θ⁻-ϕᵣ₋₁.θ⁺ - (ϕᵣ₋₁.A[1]-ϕᵣ₋₂.A[2]-Aᵣ)) 
        + ϕᵣ₊₂.u⁺*ϕᵣ₋₁.u⁻*sin(ϕᵣ₊₂.θ⁺-ϕᵣ₋₁.θ⁻ - (ϕᵣ₋₁.A[1]+ϕ.A[2]+Aᵣ)) 
        + ϕᵣ₊₁.u⁺*ϕᵣ₋₂.u⁻*sin(ϕᵣ₊₁.θ⁺-ϕᵣ₋₂.θ⁻ - (ϕ.A[1]+ϕᵣ₋₂.A[2]+Aᵣ)) - 
        (ϕᵣ₊₁.u⁻*ϕᵣ₊₂.u⁺*sin(ϕᵣ₊₂.θ⁺-ϕᵣ₊₁.θ⁻ - (ϕ.A[2]+Aᵣ-ϕ.A[1])) 
        + ϕᵣ₋₁.u⁻*ϕᵣ₋₂.u⁺*sin(ϕᵣ₋₂.θ⁺-ϕᵣ₋₁.θ⁻ - (ϕᵣ₋₁.A[1]-ϕᵣ₋₂.A[2]-Aᵣ)) 
        + ϕᵣ₊₂.u⁻*ϕᵣ₋₁.u⁺*sin(ϕᵣ₊₂.θ⁻-ϕᵣ₋₁.θ⁺ - (ϕᵣ₋₁.A[1]+ϕ.A[2]+Aᵣ)) 
        + ϕᵣ₊₁.u⁻*ϕᵣ₋₂.u⁺*sin(ϕᵣ₊₁.θ⁻-ϕᵣ₋₂.θ⁺ - (ϕ.A[1]+ϕᵣ₋₂.A[2]+Aᵣ))))
#	if ! isapprox(Fₘ, 0.0, atol=5e-13, rtol=1e-13)
#		println("MGT at h_pos:\t$(h_pos),:\t$(Fₘ)!")
#		t = (c.ν-1)/4*ϕ.u⁺*ϕ.u⁻*(sin(ϕᵣ₊₁.θ⁻-two_pi*c.f*(h_pos+1)) + sin(ϕᵣ₊₁.θ⁺+2π*c.f*(h_pos+1)) - sin(ϕᵣ₊₁.θ⁺-2π*c.f*(h_pos+1)) - sin(ϕᵣ₊₁.θ⁻+2π*c.f*(h_pos+1)))
#2		println("Then MGT at h_pos+2 should be $t")
#	end
#	@test Fₘ == 0
    energy = Fₖ + Fᵥ + Fₐₙ + Fₘ
end

# --------------------------------------------------------------------------------------------------
# Loops over all positions of the lattice of a state and calculates the total energy from the
# Higgs-field terms using the function fᵣ() + the energy from the gauge field.
function E(ψ::State)
    energy = 0.0
    L = ψ.consts.L
	g⁻² = ψ.consts.g⁻²
    
    # Contribution from the bulk of lattice sites
    for h_pos=1:L, v_pos=1:L
        ϕ = ψ.lattice[v_pos,h_pos]          # Lattice site at position r
		ϕᵣ₊₁ = ψ.nb[v_pos,h_pos].ϕᵣ₊₁
		ϕᵣ₊₂ = ψ.nb[v_pos,h_pos].ϕᵣ₊₂
        h = fᵣ(ϕ,ψ.nb[v_pos,h_pos],h_pos,ψ.consts)              # Higgs terms
#		@test h == -0.5*(ϕ.u⁺^2+ϕ.u⁺^2+ϕ.u⁻^2+ϕ.u⁻^2) + (ϕ.u⁺*ϕ.u⁻)^2*(2+ψ.consts.ν) + 0.5*(ϕ.u⁺^4 + ϕ.u⁻^4)
		energy += h
        energy += (ϕ.A[1] + ϕᵣ₊₁.A[2]-ϕᵣ₊₂.A[1]-ϕ.A[2])^2*g⁻²
    end
    energy
end

# --------------------------------------------------------------------------------------------------
# Find the energy difference between two states; one that has ϕ′ in position r with ϕᵣ... as neighbors,
# and one that has ϕ in position r. the position along the x-axis is needed for the constant Gauge field.
function ΔE(ϕ′::LatticeSite, ϕ::LatticeSite, nb::Neighbors, nnb::NextNeighbors, nnnb::NNNeighbors,
        h_pos::Int64, c::SystConstants)
    δE::Float64 = 0.0
    
    # Calculate constant link variables
    Aᵣ₊₁ = two_pi*c.f*h_pos
    Aᵣ = two_pi*c.f*(h_pos-1)
    Aᵣ₋₁ = two_pi*c.f*(h_pos-2)
    
    # Get neighbors
    ϕᵣ₊₁ = nb.ϕᵣ₊₁
    ϕᵣ₋₁ = nb.ϕᵣ₋₁
    ϕᵣ₊₂ = nb.ϕᵣ₊₂
    ϕᵣ₋₂ = nb.ϕᵣ₋₂
    ϕᵣ₊₁₊₂ = nnb.ϕᵣ₊₁₊₂
    ϕᵣ₊₁₋₂ = nnb.ϕᵣ₊₁₋₂
    ϕᵣ₋₁₊₂ = nnb.ϕᵣ₋₁₊₂
    ϕᵣ₋₁₋₂ = nnb.ϕᵣ₋₁₋₂
    ϕᵣ₊₁₁ = nnnb.ϕᵣ₊₁₁
    ϕᵣ₋₁₁ = nnnb.ϕᵣ₋₁₁
    ϕᵣ₊₂₂ = nnnb.ϕᵣ₊₂₂
    ϕᵣ₋₂₂ = nnnb.ϕᵣ₋₂₂
    
    # Normal kinetic terms
    δE += -0.5*c.γ^2*(
  ϕᵣ₊₁.u⁺*ϕᵣ₋₁.u⁺*cos(ϕᵣ₊₁.θ⁺-ϕᵣ₋₁.θ⁺-(ϕ′.A[1]+ϕᵣ₋₁.A[1])) - ϕᵣ₊₁.u⁺*ϕᵣ₋₁.u⁺*cos(ϕᵣ₊₁.θ⁺-ϕᵣ₋₁.θ⁺-(ϕ.A[1]+ϕᵣ₋₁.A[1])) 
+ ϕ′.u⁺*ϕᵣ₋₁₁.u⁺*cos(ϕ′.θ⁺-ϕᵣ₋₁₁.θ⁺-(ϕᵣ₋₁.A[1]+ϕᵣ₋₁₁.A[1])) - ϕ.u⁺*ϕᵣ₋₁₁.u⁺*cos(ϕ.θ⁺-ϕᵣ₋₁₁.θ⁺-(ϕᵣ₋₁.A[1]+ϕᵣ₋₁₁.A[1])) 
+ ϕᵣ₊₁₁.u⁺*ϕ′.u⁺*cos(ϕᵣ₊₁₁.θ⁺-ϕ′.θ⁺-(ϕᵣ₊₁.A[1]+ϕ′.A[1])) - ϕᵣ₊₁₁.u⁺*ϕ.u⁺*cos(ϕᵣ₊₁₁.θ⁺-ϕ.θ⁺-(ϕᵣ₊₁.A[1]+ϕ.A[1])) 

+ ϕᵣ₊₂.u⁺*ϕᵣ₋₂.u⁺*cos(ϕᵣ₊₂.θ⁺-ϕᵣ₋₂.θ⁺-(ϕ′.A[2]+ϕᵣ₋₂.A[2]+2*Aᵣ)) - ϕᵣ₊₂.u⁺*ϕᵣ₋₂.u⁺*cos(ϕᵣ₊₂.θ⁺-ϕᵣ₋₂.θ⁺-(ϕ.A[2]+ϕᵣ₋₂.A[2]+2*Aᵣ)) 
+ ϕ′.u⁺*ϕᵣ₋₂₂.u⁺*cos(ϕ′.θ⁺-ϕᵣ₋₂₂.θ⁺-(ϕᵣ₋₂.A[2]+ϕᵣ₋₂₂.A[2]+2*Aᵣ)) - ϕ.u⁺*ϕᵣ₋₂₂.u⁺*cos(ϕ.θ⁺-ϕᵣ₋₂₂.θ⁺-(ϕᵣ₋₂.A[2]+ϕᵣ₋₂₂.A[2]+2*Aᵣ)) 
+ ϕᵣ₊₂₂.u⁺*ϕ′.u⁺*cos(ϕᵣ₊₂₂.θ⁺-ϕ′.θ⁺-(ϕᵣ₊₂.A[2]+ϕ′.A[2]+2*Aᵣ)) - ϕᵣ₊₂₂.u⁺*ϕ.u⁺*cos(ϕᵣ₊₂₂.θ⁺-ϕ.θ⁺-(ϕᵣ₊₂.A[2]+ϕ.A[2]+2*Aᵣ)) 
        
+ ϕᵣ₊₁.u⁻*ϕᵣ₋₁.u⁻*cos(ϕᵣ₊₁.θ⁻-ϕᵣ₋₁.θ⁻-(ϕ′.A[1]+ϕᵣ₋₁.A[1])) - ϕᵣ₊₁.u⁻*ϕᵣ₋₁.u⁻*cos(ϕᵣ₊₁.θ⁻-ϕᵣ₋₁.θ⁻-(ϕ.A[1]+ϕᵣ₋₁.A[1])) 
+ ϕ′.u⁻*ϕᵣ₋₁₁.u⁻*cos(ϕ′.θ⁻-ϕᵣ₋₁₁.θ⁻-(ϕᵣ₋₁.A[1]+ϕᵣ₋₁₁.A[1])) - ϕ.u⁻*ϕᵣ₋₁₁.u⁻*cos(ϕ.θ⁻-ϕᵣ₋₁₁.θ⁻-(ϕᵣ₋₁.A[1]+ϕᵣ₋₁₁.A[1])) 
+ ϕᵣ₊₁₁.u⁻*ϕ′.u⁻*cos(ϕᵣ₊₁₁.θ⁻-ϕ′.θ⁻-(ϕᵣ₊₁.A[1]+ϕ′.A[1])) - ϕᵣ₊₁₁.u⁻*ϕ.u⁻*cos(ϕᵣ₊₁₁.θ⁻-ϕ.θ⁻-(ϕᵣ₊₁.A[1]+ϕ.A[1])) 

+ ϕᵣ₊₂.u⁻*ϕᵣ₋₂.u⁻*cos(ϕᵣ₊₂.θ⁻-ϕᵣ₋₂.θ⁻-(ϕ′.A[2]+ϕᵣ₋₂.A[2]+2*Aᵣ)) - ϕᵣ₊₂.u⁻*ϕᵣ₋₂.u⁻*cos(ϕᵣ₊₂.θ⁻-ϕᵣ₋₂.θ⁻-(ϕ.A[2]+ϕᵣ₋₂.A[2]+2*Aᵣ)) 
+ ϕ′.u⁻*ϕᵣ₋₂₂.u⁻*cos(ϕ′.θ⁻-ϕᵣ₋₂₂.θ⁻-(ϕᵣ₋₂.A[2]+ϕᵣ₋₂₂.A[2]+2*Aᵣ)) - ϕ.u⁻*ϕᵣ₋₂₂.u⁻*cos(ϕ.θ⁻-ϕᵣ₋₂₂.θ⁻-(ϕᵣ₋₂.A[2]+ϕᵣ₋₂₂.A[2]+2*Aᵣ)) 
+ ϕᵣ₊₂₂.u⁻*ϕ′.u⁻*cos(ϕᵣ₊₂₂.θ⁻-ϕ′.θ⁻-(ϕᵣ₊₂.A[2]+ϕ′.A[2]+2*Aᵣ)) - ϕᵣ₊₂₂.u⁻*ϕ.u⁻*cos(ϕᵣ₊₂₂.θ⁻-ϕ.θ⁻-(ϕᵣ₊₂.A[2]+ϕ.A[2]+2*Aᵣ)))
    
    # Potential energy terms
    δE += c.γ^4*((ϕ′.u⁺*ϕ′.u⁻)^2*(2+c.ν*cos(2*(ϕ′.θ⁺-ϕ′.θ⁻))) - (ϕ.u⁺*ϕ.u⁻)^2*(2+c.ν*cos(2*(ϕ.θ⁺-ϕ.θ⁻))) 
        + 0.5*(ϕ′.u⁺^4-ϕ.u⁺^4+ϕ′.u⁻^4-ϕ.u⁻^4))
    
    # Andreev-Bashkin terms
    δE += (c.ν+1)/4*c.γ^2*(
  ϕᵣ₊₂.u⁺*ϕᵣ₋₂.u⁻*cos(ϕᵣ₊₂.θ⁺-ϕᵣ₋₂.θ⁻-(ϕ′.A[2]+ϕᵣ₋₂.A[2]+2*Aᵣ)) - ϕᵣ₊₂.u⁺*ϕᵣ₋₂.u⁻*cos(ϕᵣ₊₂.θ⁺-ϕᵣ₋₂.θ⁻-(ϕ.A[2]+ϕᵣ₋₂.A[2]+2*Aᵣ)) 
+ ϕ′.u⁺*ϕᵣ₋₂₂.u⁻*cos(ϕ′.θ⁺-ϕᵣ₋₂₂.θ⁻-(ϕᵣ₋₂.A[2]+ϕᵣ₋₂₂.A[2]+2*Aᵣ)) -  ϕ.u⁺*ϕᵣ₋₂₂.u⁻*cos(ϕ.θ⁺-ϕᵣ₋₂₂.θ⁻-(ϕᵣ₋₂.A[2]+ϕᵣ₋₂₂.A[2]+2*Aᵣ)) 
+ ϕᵣ₊₂₂.u⁺*ϕ′.u⁻*cos(ϕᵣ₊₂₂.θ⁺-ϕ′.θ⁻-(ϕᵣ₊₂.A[2]+ϕ′.A[2]+2*Aᵣ)) - ϕᵣ₊₂₂.u⁺*ϕ.u⁻*cos(ϕᵣ₊₂₂.θ⁺-ϕ.θ⁻-(ϕᵣ₊₂.A[2]+ϕ.A[2]+2*Aᵣ))
    
- ϕᵣ₊₁.u⁺*ϕᵣ₋₁.u⁻*cos(ϕᵣ₊₁.θ⁺-ϕᵣ₋₁.θ⁻-(ϕ′.A[1]+ϕᵣ₋₁.A[1])) + ϕᵣ₊₁.u⁺*ϕᵣ₋₁.u⁻*cos(ϕᵣ₊₁.θ⁺-ϕᵣ₋₁.θ⁻-(ϕ.A[1]+ϕᵣ₋₁.A[1])) 
- ϕ′.u⁺*ϕᵣ₋₁₁.u⁻*cos(ϕ′.θ⁺-ϕᵣ₋₁₁.θ⁻-(ϕᵣ₋₁.A[1]+ϕᵣ₋₁₁.A[1])) +  ϕ.u⁺*ϕᵣ₋₁₁.u⁻*cos(ϕ.θ⁺-ϕᵣ₋₁₁.θ⁻-(ϕᵣ₋₁.A[1]+ϕᵣ₋₁₁.A[1])) 
- ϕᵣ₊₁₁.u⁺*ϕ′.u⁻*cos(ϕᵣ₊₁₁.θ⁺-ϕ′.θ⁻-(ϕᵣ₊₁.A[1]+ϕ′.A[1])) + ϕᵣ₊₁₁.u⁺*ϕ.u⁻*cos(ϕᵣ₊₁₁.θ⁺-ϕ.θ⁻-(ϕᵣ₊₁.A[1]+ϕ.A[1]))

+ ϕᵣ₊₂.u⁻*ϕᵣ₋₂.u⁺*cos(ϕᵣ₊₂.θ⁻-ϕᵣ₋₂.θ⁺-(ϕ′.A[2]+ϕᵣ₋₂.A[2]+2*Aᵣ)) - ϕᵣ₊₂.u⁻*ϕᵣ₋₂.u⁺*cos(ϕᵣ₊₂.θ⁻-ϕᵣ₋₂.θ⁺-(ϕ.A[2]+ϕᵣ₋₂.A[2]+2*Aᵣ)) 
+ ϕ′.u⁻*ϕᵣ₋₂₂.u⁺*cos(ϕ′.θ⁻-ϕᵣ₋₂₂.θ⁺-(ϕᵣ₋₂.A[2]+ϕᵣ₋₂₂.A[2]+2*Aᵣ)) -  ϕ.u⁻*ϕᵣ₋₂₂.u⁺*cos(ϕ.θ⁻-ϕᵣ₋₂₂.θ⁺-(ϕᵣ₋₂.A[2]+ϕᵣ₋₂₂.A[2]+2*Aᵣ)) 
+ ϕᵣ₊₂₂.u⁻*ϕ′.u⁺*cos(ϕᵣ₊₂₂.θ⁻-ϕ′.θ⁺-(ϕᵣ₊₂.A[2]+ϕ′.A[2]+2*Aᵣ)) - ϕᵣ₊₂₂.u⁻*ϕ.u⁺*cos(ϕᵣ₊₂₂.θ⁻-ϕ.θ⁺-(ϕᵣ₊₂.A[2]+ϕ.A[2]+2*Aᵣ))
    
- ϕᵣ₊₁.u⁻*ϕᵣ₋₁.u⁺*cos(ϕᵣ₊₁.θ⁻-ϕᵣ₋₁.θ⁺-(ϕ′.A[1]+ϕᵣ₋₁.A[1])) + ϕᵣ₊₁.u⁻*ϕᵣ₋₁.u⁺*cos(ϕᵣ₊₁.θ⁻-ϕᵣ₋₁.θ⁺-(ϕ.A[1]+ϕᵣ₋₁.A[1])) 
- ϕ′.u⁻*ϕᵣ₋₁₁.u⁺*cos(ϕ′.θ⁻-ϕᵣ₋₁₁.θ⁺-(ϕᵣ₋₁.A[1]+ϕᵣ₋₁₁.A[1])) +  ϕ.u⁻*ϕᵣ₋₁₁.u⁺*cos(ϕ.θ⁻-ϕᵣ₋₁₁.θ⁺-(ϕᵣ₋₁.A[1]+ϕᵣ₋₁₁.A[1])) 
- ϕᵣ₊₁₁.u⁻*ϕ′.u⁺*cos(ϕᵣ₊₁₁.θ⁻-ϕ′.θ⁺-(ϕᵣ₊₁.A[1]+ϕ′.A[1])) + ϕᵣ₊₁₁.u⁻*ϕ.u⁺*cos(ϕᵣ₊₁₁.θ⁻-ϕ.θ⁺-(ϕᵣ₊₁.A[1]+ϕ.A[1])))
    
    # Mixed gradient terms 
    δE += (c.ν-1)/4*c.γ^2*(
  ϕᵣ₊₁.u⁺*ϕᵣ₊₂.u⁻*sin(ϕᵣ₊₂.θ⁻-ϕᵣ₊₁.θ⁺-(ϕ′.A[2]+Aᵣ-ϕ′.A[1])) - ϕᵣ₊₁.u⁺*ϕᵣ₊₂.u⁻*sin(ϕᵣ₊₂.θ⁻-ϕᵣ₊₁.θ⁺-(ϕ.A[2]+Aᵣ-ϕ.A[1]))
+ ϕᵣ₊₂.u⁺*ϕᵣ₋₁.u⁻*sin(ϕᵣ₊₂.θ⁺-ϕᵣ₋₁.θ⁻-(ϕᵣ₋₁.A[1]+ϕ′.A[2]+Aᵣ)) - ϕᵣ₊₂.u⁺*ϕᵣ₋₁.u⁻*sin(ϕᵣ₊₂.θ⁺-ϕᵣ₋₁.θ⁻-(ϕᵣ₋₁.A[1]+ϕ.A[2]+Aᵣ))
+ ϕᵣ₊₁.u⁺*ϕᵣ₋₂.u⁻*sin(ϕᵣ₊₁.θ⁺-ϕᵣ₋₂.θ⁻-(ϕ′.A[1]+ϕᵣ₋₂.A[2]+Aᵣ)) - ϕᵣ₊₁.u⁺*ϕᵣ₋₂.u⁻*sin(ϕᵣ₊₁.θ⁺-ϕᵣ₋₂.θ⁻-(ϕ.A[1]+ϕᵣ₋₂.A[2]+Aᵣ))

+ ϕ′.u⁺*ϕᵣ₋₁₊₂.u⁻*sin(ϕᵣ₋₁₊₂.θ⁻-ϕ′.θ⁺-(ϕᵣ₋₁.A[2]+Aᵣ₋₁-ϕᵣ₋₁.A[1])) - ϕ.u⁺*ϕᵣ₋₁₊₂.u⁻*sin(ϕᵣ₋₁₊₂.θ⁻-ϕ.θ⁺-(ϕᵣ₋₁.A[2]+Aᵣ₋₁-ϕᵣ₋₁.A[1]))
+ ϕ′.u⁺*ϕᵣ₋₁₋₂.u⁻*sin(ϕ′.θ⁺-ϕᵣ₋₁₋₂.θ⁻-(ϕᵣ₋₁.A[1]+ϕᵣ₋₁₋₂.A[2]+Aᵣ₋₁)) - ϕ.u⁺*ϕᵣ₋₁₋₂.u⁻*sin(ϕ.θ⁺-ϕᵣ₋₁₋₂.θ⁻-(ϕᵣ₋₁.A[1]+ϕᵣ₋₁₋₂.A[2]+Aᵣ₋₁))

+ ϕᵣ₊₁₋₂.u⁺*ϕ′.u⁻*sin(ϕ′.θ⁻-ϕᵣ₊₁₋₂.θ⁺-(ϕᵣ₋₂.A[2]+Aᵣ-ϕᵣ₋₂.A[1])) - ϕᵣ₊₁₋₂.u⁺*ϕ.u⁻*sin(ϕ.θ⁻-ϕᵣ₊₁₋₂.θ⁺-(ϕᵣ₋₂.A[2]+Aᵣ-ϕᵣ₋₂.A[1]))
+ ϕ′.u⁺*ϕᵣ₋₁₋₂.u⁻*sin(ϕ′.θ⁺-ϕᵣ₋₁₋₂.θ⁻-(ϕᵣ₋₁₋₂.A[1]+ϕᵣ₋₂.A[2]+Aᵣ)) - ϕ.u⁺*ϕᵣ₋₁₋₂.u⁻*sin(ϕ.θ⁺-ϕᵣ₋₁₋₂.θ⁻-(ϕᵣ₋₁₋₂.A[1]+ϕᵣ₋₂.A[2]+Aᵣ))

+ ϕ′.u⁺*ϕᵣ₊₁₋₂.u⁻*sin(ϕᵣ₊₁₋₂.θ⁻-ϕ′.θ⁺-(ϕ′.A[1]-ϕᵣ₊₁₋₂.A[2]-Aᵣ₊₁)) - ϕ.u⁺*ϕᵣ₊₁₋₂.u⁻*sin(ϕᵣ₊₁₋₂.θ⁻-ϕ.θ⁺-(ϕ.A[1]-ϕᵣ₊₁₋₂.A[2]-Aᵣ₊₁))
+ ϕᵣ₊₁₊₂.u⁺*ϕ′.u⁻*sin(ϕᵣ₊₁₊₂.θ⁺-ϕ′.θ⁻-(ϕ′.A[1]+ϕᵣ₊₁.A[2]+Aᵣ₊₁)) - ϕᵣ₊₁₊₂.u⁺*ϕ.u⁻*sin(ϕᵣ₊₁₊₂.θ⁺-ϕ.θ⁻-(ϕ.A[1]+ϕᵣ₊₁.A[2]+Aᵣ₊₁))
    
+ ϕᵣ₋₁₊₂.u⁺*ϕ′.u⁻*sin(ϕ′.θ⁻-ϕᵣ₋₁₊₂.θ⁺-(ϕᵣ₋₁₊₂.A[1]-ϕ′.A[2]-Aᵣ)) - ϕᵣ₋₁₊₂.u⁺*ϕ.u⁻*sin(ϕ.θ⁻-ϕᵣ₋₁₊₂.θ⁺-(ϕᵣ₋₁₊₂.A[1]-ϕ.A[2]-Aᵣ))
+ ϕᵣ₊₁₊₂.u⁺*ϕ′.u⁻*sin(ϕᵣ₊₁₊₂.θ⁺-ϕ′.θ⁻-(ϕᵣ₊₂.A[1]+ϕ′.A[2]+Aᵣ)) - ϕᵣ₊₁₊₂.u⁺*ϕ.u⁻*sin(ϕᵣ₊₁₊₂.θ⁺-ϕ.θ⁻-(ϕᵣ₊₂.A[1]+ϕ.A[2]+Aᵣ))
    
  -(ϕᵣ₊₁.u⁻*ϕᵣ₊₂.u⁺*sin(ϕᵣ₊₂.θ⁺-ϕᵣ₊₁.θ⁻-(ϕ′.A[2]+Aᵣ-ϕ′.A[1])) - ϕᵣ₊₁.u⁻*ϕᵣ₊₂.u⁺*sin(ϕᵣ₊₂.θ⁺-ϕᵣ₊₁.θ⁻-(ϕ.A[2]+Aᵣ-ϕ.A[1]))
+ ϕᵣ₊₂.u⁻*ϕᵣ₋₁.u⁺*sin(ϕᵣ₊₂.θ⁻-ϕᵣ₋₁.θ⁺-(ϕᵣ₋₁.A[1]+ϕ′.A[2]+Aᵣ)) - ϕᵣ₊₂.u⁻*ϕᵣ₋₁.u⁺*sin(ϕᵣ₊₂.θ⁻-ϕᵣ₋₁.θ⁺-(ϕᵣ₋₁.A[1]+ϕ.A[2]+Aᵣ))
+ ϕᵣ₊₁.u⁻*ϕᵣ₋₂.u⁺*sin(ϕᵣ₊₁.θ⁻-ϕᵣ₋₂.θ⁺-(ϕ′.A[1]+ϕᵣ₋₂.A[2]+Aᵣ)) - ϕᵣ₊₁.u⁻*ϕᵣ₋₂.u⁺*sin(ϕᵣ₊₁.θ⁻-ϕᵣ₋₂.θ⁺-(ϕ.A[1]+ϕᵣ₋₂.A[2]+Aᵣ))

+ ϕ′.u⁻*ϕᵣ₋₁₊₂.u⁺*sin(ϕᵣ₋₁₊₂.θ⁺-ϕ′.θ⁻-(ϕᵣ₋₁.A[2]+Aᵣ₋₁-ϕᵣ₋₁.A[1])) - ϕ.u⁻*ϕᵣ₋₁₊₂.u⁺*sin(ϕᵣ₋₁₊₂.θ⁺-ϕ.θ⁻-(ϕᵣ₋₁.A[2]+Aᵣ₋₁-ϕᵣ₋₁.A[1]))
+ ϕ′.u⁻*ϕᵣ₋₁₋₂.u⁺*sin(ϕ′.θ⁻-ϕᵣ₋₁₋₂.θ⁺-(ϕᵣ₋₁.A[1]+ϕᵣ₋₁₋₂.A[2]+Aᵣ₋₁)) - ϕ.u⁻*ϕᵣ₋₁₋₂.u⁺*sin(ϕ.θ⁻-ϕᵣ₋₁₋₂.θ⁺-(ϕᵣ₋₁.A[1]+ϕᵣ₋₁₋₂.A[2]+Aᵣ₋₁))

+ ϕᵣ₊₁₋₂.u⁻*ϕ′.u⁺*sin(ϕ′.θ⁺-ϕᵣ₊₁₋₂.θ⁻-(ϕᵣ₋₂.A[2]+Aᵣ-ϕᵣ₋₂.A[1])) - ϕᵣ₊₁₋₂.u⁻*ϕ.u⁺*sin(ϕ.θ⁺-ϕᵣ₊₁₋₂.θ⁻-(ϕᵣ₋₂.A[2]+Aᵣ-ϕᵣ₋₂.A[1]))
+ ϕ′.u⁻*ϕᵣ₋₁₋₂.u⁺*sin(ϕ′.θ⁻-ϕᵣ₋₁₋₂.θ⁺-(ϕᵣ₋₁₋₂.A[1]+ϕᵣ₋₂.A[2]+Aᵣ)) - ϕ.u⁻*ϕᵣ₋₁₋₂.u⁺*sin(ϕ.θ⁻-ϕᵣ₋₁₋₂.θ⁺-(ϕᵣ₋₁₋₂.A[1]+ϕᵣ₋₂.A[2]+Aᵣ))

+ ϕ′.u⁻*ϕᵣ₊₁₋₂.u⁺*sin(ϕᵣ₊₁₋₂.θ⁺-ϕ′.θ⁻-(ϕ′.A[1]-ϕᵣ₊₁₋₂.A[2]-Aᵣ₊₁)) - ϕ.u⁻*ϕᵣ₊₁₋₂.u⁺*sin(ϕᵣ₊₁₋₂.θ⁺-ϕ.θ⁻-(ϕ.A[1]-ϕᵣ₊₁₋₂.A[2]-Aᵣ₊₁))
+ ϕᵣ₊₁₊₂.u⁻*ϕ′.u⁺*sin(ϕᵣ₊₁₊₂.θ⁻-ϕ′.θ⁺-(ϕ′.A[1]+ϕᵣ₊₁.A[2]+Aᵣ₊₁)) - ϕᵣ₊₁₊₂.u⁻*ϕ.u⁺*sin(ϕᵣ₊₁₊₂.θ⁻-ϕ.θ⁺-(ϕ.A[1]+ϕᵣ₊₁.A[2]+Aᵣ₊₁))
    
+ ϕᵣ₋₁₊₂.u⁻*ϕ′.u⁺*sin(ϕ′.θ⁺-ϕᵣ₋₁₊₂.θ⁻-(ϕᵣ₋₁₊₂.A[1]-ϕ′.A[2]-Aᵣ)) - ϕᵣ₋₁₊₂.u⁻*ϕ.u⁺*sin(ϕ.θ⁺-ϕᵣ₋₁₊₂.θ⁻-(ϕᵣ₋₁₊₂.A[1]-ϕ.A[2]-Aᵣ))
+ ϕᵣ₊₁₊₂.u⁻*ϕ′.u⁺*sin(ϕᵣ₊₁₊₂.θ⁻-ϕ′.θ⁺-(ϕᵣ₊₂.A[1]+ϕ′.A[2]+Aᵣ)) - ϕᵣ₊₁₊₂.u⁻*ϕ.u⁺*sin(ϕᵣ₊₁₊₂.θ⁻-ϕ.θ⁺-(ϕᵣ₊₂.A[1]+ϕ.A[2]+Aᵣ))))
    
    # Then calculate the Gauge field contribution
    # First contribution from current position
    δE += ((ϕ′.A[1] + ϕᵣ₊₁.A[2] - ϕᵣ₊₂.A[1] - ϕ′.A[2])^2 - (ϕ.A[1] + ϕᵣ₊₁.A[2] - ϕᵣ₊₂.A[1] - ϕ.A[2])^2)*c.g⁻²
    # Then from position r-x
    δE += ((ϕᵣ₋₁.A[1] + ϕ′.A[2] - ϕᵣ₋₁₊₂.A[1] - ϕᵣ₋₁.A[2])^2 - (ϕᵣ₋₁.A[1] + ϕ.A[2] - ϕᵣ₋₁₊₂.A[1] - ϕᵣ₋₁.A[2])^2)*c.g⁻²
    # Then from position r-y
    δE += ((ϕᵣ₋₂.A[1] + ϕᵣ₊₁₋₂.A[2] - ϕ′.A[1] - ϕᵣ₋₂.A[2])^2 - (ϕᵣ₋₂.A[1] + ϕᵣ₊₁₋₂.A[2] - ϕ.A[1] - ϕᵣ₋₂.A[2])^2)*c.g⁻²
    δE
end
